# =============================================================================
# Ensemble Pipeline — Inferencer config.pbtxt
# =============================================================================
# 실제 추론 모델 (.onnx, .plan 등) — CI가 모델 바이너리를 배치
# =============================================================================

name: "inferencer"
backend: "onnxruntime"         # 실제 백엔드에 맞게 변경 (tensorrt 등)
max_batch_size: 8

input [
  {
    name: "PREPROCESSED"
    data_type: TYPE_FP32
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "RAW_OUTPUT"
    data_type: TYPE_FP32
    dims: [-1]                 # 모델 출력 shape에 맞게 수정
  }
]

dynamic_batching {
  preferred_batch_size: [4, 8]
  max_queue_delay_microseconds: 100
}

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
    rate_limiter {
      resources [{ name: "gpu_slot" count: 1 }]
      priority: 1
    }
  }
]

model_warmup [
  {
    name: "warmup_request"
    batch_size: 1
    inputs {
      key: "PREPROCESSED"
      value: { data_type: TYPE_FP32 dims: [3, 224, 224] zero_data: true }
    }
  }
]

version_policy: { latest: { num_versions: 2 } }
