# NLP — LLM Serving (vLLM Backend, Decoupled Streaming)

name: "llm_vllm"
backend: "vllm"
max_batch_size: 0              # vLLM은 자체 batching 사용

model_transaction_policy {
  decoupled: true
}

input [
  { name: "text_input"          data_type: TYPE_STRING dims: [-1] },
  { name: "stream"              data_type: TYPE_BOOL   dims: [1] },
  { name: "sampling_parameters" data_type: TYPE_STRING dims: [-1] }
]

output [
  { name: "text_output"         data_type: TYPE_STRING dims: [-1] }
]

instance_group [
  {
    count: 1
    kind: KIND_MODEL            # vLLM은 KIND_MODEL 사용
  }
]
