# =============================================================================
# Ensemble Pipeline — Pipeline (Ensemble Scheduler) config.pbtxt
# =============================================================================
# DAG 형태로 전처리 → 추론 → 후처리를 연결
# ensemble_scheduling 의 step 으로 데이터 흐름을 정의
# =============================================================================

name: "pipeline"
platform: "ensemble"
max_batch_size: 8

input [
  {
    name: "RAW_INPUT"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]

output [
  {
    name: "FINAL_OUTPUT"
    data_type: TYPE_FP32
    dims: [-1]
  }
]

ensemble_scheduling {
  step [
    # Step 1: 전처리
    {
      model_name: "preprocessor"
      model_version: -1        # 최신 버전 사용
      input_map {
        key: "RAW_INPUT"
        value: "RAW_INPUT"
      }
      output_map {
        key: "PREPROCESSED"
        value: "PREPROCESSED"
      }
    },

    # Step 2: 추론
    {
      model_name: "inferencer"
      model_version: -1
      input_map {
        key: "PREPROCESSED"
        value: "PREPROCESSED"
      }
      output_map {
        key: "RAW_OUTPUT"
        value: "RAW_OUTPUT"
      }
    },

    # Step 3: 후처리
    {
      model_name: "postprocessor"
      model_version: -1
      input_map {
        key: "RAW_OUTPUT"
        value: "RAW_OUTPUT"
      }
      output_map {
        key: "FINAL_OUTPUT"
        value: "FINAL_OUTPUT"
      }
    }
  ]
}
